БухЭксп/DataProcessors/CW_ОбновлениеМониторинговыхПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ОбновлениеМониторинговыхПараметров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СлужебныйВыполненПереход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СлужебныйВыполненПереход</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Заявки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПеревозок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ОбновлениеМониторинговыхПараметров/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработатьВсе(Команда)
	
	Если ОбновитьСуществующиеДанные Тогда
		УдалитьДанныеРегистраСлужебныйВыполненПереход();	
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ВыполнитьОбработкуСправочников",0.1,Истина);	

КонецПроцедуры

&НаСервере
Процедура УдалитьДанныеРегистраСлужебныйВыполненПереход()
	
	Набор = РегистрыСведений.CW_СлужебныйВыполненПереход.СоздатьНаборЗаписей();
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуСправочников()
	
	Если НЕ Выполняется Тогда	
		ВыполнитьОбработчики();
	КонецЕсли;
	
	Если Выполняется Тогда
		ПодключитьОбработчикОжидания("ВыполнитьОбработкуСправочников",0.1,Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработчики()
	
	Если ФлагТипыПеревозозок И НЕ Выполняется Тогда
		ДополнитьДанныеТиповПеревозокНаКлиенте();
	КонецЕсли;
	
	Если ФлагЗаявки И НЕ Выполняется  Тогда
		ДополнитьДанныеЗаявокНаКлиенте();
	КонецЕсли;
	
	Если ФлагЗаказы И НЕ Выполняется  Тогда
		ДополнитьДанныеЗаказовНаКлиенте();
	КонецЕсли;
	
	Если ФлагГрузоперевозки И НЕ Выполняется  Тогда
		ДополнитьДанныеГрузоперевозокНаКлиенте();
	КонецЕсли;
	
	Если НЕ (ФлагТипыПеревозозок И ФлагЗаявки и ФлагЗаказы и ФлагГрузоперевозки) Тогда
		ОтключитьОбработчикОжидания("ВыполнитьОбработкуСправочников");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДанныеТиповПеревозокНаКлиенте()
	
	ИндикаторТипыПеревозок = 0;
	Выполняется = Истина;
	
	ВсегоТиповПеревозок = ПолучитьКоличествоТиповПеревозок();
	Если ВсегоТиповПеревозок = 0 Тогда
		Выполняется = Ложь;
		ФлагТипыПеревозозок = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ИндикаторТипыПеревозок.МаксимальноеЗначение = ВсегоТиповПеревозок;
	
	ИмяОбработчика = "ОбработчикДополнитьДанныеТиповПеревозок";
	ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДополнитьДанныеТиповПеревозок()
	
	ОбработкаПрерыванияПользователя();
	
	Обработано = 0;
	ЕстьДанные = ДополнитьДанныеТиповПеревозокНаСервере(Обработано);
	ИндикаторТипыПеревозок = ИндикаторТипыПеревозок+Обработано; 
	
	Если ЕстьДанные Тогда 
		Выполняется = Истина;
		ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);
	Иначе
		ИндикаторТипыПеревозок = ВсегоТиповПеревозок;
		Выполняется = Ложь;
		ФлагТипыПеревозозок = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДанныеЗаявокНаКлиенте()
	
	ИндикаторЗаявки = 0;
	Выполняется = Истина;
	
	ВсегоЗаявок = ПолучитьКоличествоЗаявок();
	Если ВсегоЗаявок = 0 Тогда
		Выполняется = Ложь;
		ФлагЗаявки = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ИндикаторЗаявки.МаксимальноеЗначение = ВсегоЗаявок;
	
	ИмяОбработчика = "ОбработчикДополнитьДанныеЗаявок";
	ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДополнитьДанныеЗаявок()
	
	ОбработкаПрерыванияПользователя();
	
	Обработано = 0;
	ЕстьДанные = ДополнитьДанныеЗаявокНаСервере(Обработано);
	ИндикаторЗаявки = ИндикаторЗаявки + Обработано; 
	
	Если ЕстьДанные Тогда
		Выполняется = Истина;
		ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);
	Иначе
		ИндикаторЗаявки 	= ВсегоЗаявок;
		Выполняется = Ложь;
		ФлагЗаявки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДанныеГрузоперевозокНаКлиенте()
	
	Выполняется = Истина;
	ИндикаторГрузоперевозк = 0;
	
	ВсегоГрузоперевозок = ПолучитьКоличествоПеревозок();
	Если ВсегоГрузоперевозок = 0 Тогда
		Выполняется = Ложь;
		ФлагГрузоперевозки = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ИндикаторГрузоперевозк.МаксимальноеЗначение = ВсегоГрузоперевозок;
	
	ИмяОбработчика = "ОбработчикДополнитьДанныеГрузоперевозок";
	ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДополнитьДанныеГрузоперевозок()
	
	ОбработкаПрерыванияПользователя();
	
	Обработано = 0;
	ЕстьДанные = ДополнитьДанныеГрузоперевозокНаСервере(Обработано);
	ИндикаторГрузоперевозк = ИндикаторГрузоперевозк + Обработано; 
	
	Если ЕстьДанные Тогда
		Выполняется = Истина;
		ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);
	Иначе
		ИндикаторГрузоперевозк 	= ВсегоГрузоперевозок;
		Выполняется = Ложь;
		ФлагГрузоперевозки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДанныеЗаказовНаКлиенте()
	
	Выполняется = Истина;
	ИндикаторЗаказы = 0;
	
	ВсегоЗаказов = ПолучитьКоличествоЗаказов();
	Если ВсегоЗаказов = 0 Тогда
		Выполняется = Ложь;
		ФлагЗаказы = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ИндикаторЗаказы.МаксимальноеЗначение = ВсегоЗаказов;
	
	ИмяОбработчика = "ОбработчикДополнитьДанныеЗаказов";
	ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДополнитьДанныеЗаказов()
	
	ОбработкаПрерыванияПользователя();
	
	Обработано = 0;
	ЕстьДанные = ДополнитьДанныеЗаказовНаСервере(Обработано);
	ИндикаторЗаказы = ИндикаторЗаказы + Обработано; 
	
	Если ЕстьДанные Тогда
		Выполняется = Истина;
		ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);
	Иначе
		ФлагЗаказы = Ложь;
		Выполняется = Ложь;
		ИндикаторЗаказы 	= ВсегоЗаказов;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьКоличествоТиповПеревозок()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_ТипыПеревозок.Ссылка) КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок КАК CW_ТипыПеревозок
	               |ГДЕ
	               |	НЕ CW_ТипыПеревозок.Ссылка В
	               |				(ВЫБРАТЬ
	               |					CW_СлужебныйВыполненПереход.Объект КАК Объект
	               |				ИЗ
	               |					РегистрСведений.CW_СлужебныйВыполненПереход КАК CW_СлужебныйВыполненПереход
	               |				ГДЕ
	               |					CW_СлужебныйВыполненПереход.ТипОбъекта = &ТипОбъекта)";
	
	Запрос.УстановитьПараметр("ТипОбъекта", "CW_ТипыПеревозок");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоЗаявок()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_Заявки.Ссылка) КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Заявки КАК CW_Заявки
	               |ГДЕ
	               |	НЕ CW_Заявки.Ссылка В
	               |				(ВЫБРАТЬ
	               |					CW_СлужебныйВыполненПереход.Объект КАК Объект
	               |				ИЗ
	               |					РегистрСведений.CW_СлужебныйВыполненПереход КАК CW_СлужебныйВыполненПереход
	               |				ГДЕ
	               |					CW_СлужебныйВыполненПереход.ТипОбъекта = &ТипОбъекта)";
	
	Запрос.УстановитьПараметр("ТипОбъекта", "CW_Заявки");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоПеревозок()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_Грузоперевозки.Ссылка) КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	НЕ CW_Грузоперевозки.Ссылка В
	               |				(ВЫБРАТЬ
	               |					CW_СлужебныйВыполненПереход.Объект КАК Объект
	               |				ИЗ
	               |					РегистрСведений.CW_СлужебныйВыполненПереход КАК CW_СлужебныйВыполненПереход
	               |				ГДЕ
	               |					CW_СлужебныйВыполненПереход.ТипОбъекта = &ТипОбъекта)";
	
	Запрос.УстановитьПараметр("ТипОбъекта", "CW_Грузоперевозки");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоЗаказов()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_Заказы.Ссылка) КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Заказы КАК CW_Заказы
	               |ГДЕ
	               |	НЕ CW_Заказы.Ссылка В
	               |				(ВЫБРАТЬ
	               |					CW_СлужебныйВыполненПереход.Объект КАК Объект
	               |				ИЗ
	               |					РегистрСведений.CW_СлужебныйВыполненПереход КАК CW_СлужебныйВыполненПереход
	               |				ГДЕ
	               |					CW_СлужебныйВыполненПереход.ТипОбъекта = &ТипОбъекта)";
	
	Запрос.УстановитьПараметр("ТипОбъекта", "CW_Заказы");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции



//Обработка данных
&НаСервере
Функция ДополнитьДанныеТиповПеревозокНаСервере(Обработано)
	
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	               |	CW_ТипыПеревозок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок КАК CW_ТипыПеревозок
	               |ГДЕ
	               |	НЕ CW_ТипыПеревозок.Ссылка В
	               |				(ВЫБРАТЬ
	               |					CW_СлужебныйВыполненПереход.Объект КАК Объект
	               |				ИЗ
	               |					РегистрСведений.CW_СлужебныйВыполненПереход КАК CW_СлужебныйВыполненПереход
	               |				ГДЕ
	               |					CW_СлужебныйВыполненПереход.ТипОбъекта = &ТипОбъекта)";

	Запрос.УстановитьПараметр("ТипОбъекта", "CW_ТипыПеревозок");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Обработано = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектТипПеревозки = Выборка.Ссылка.ПолучитьОбъект();
		

		//Параметры грузоперевозок
		ВладельцыПараметров = Новый Соответствие;
		мПорядокПараметров 	= новый Массив;
		ОбработатьТабличнуюЧасть(ВладельцыПараметров, мПорядокПараметров, ОбъектТипПеревозки.ГруппыПараметровГрузоперевозки, ОбъектТипПеревозки.ПараметрыГрузоперевозки);
	
		//Параметры заявок
		ВладельцыПараметров = Новый Соответствие;
		мПорядокПараметров 	= новый Массив;
		ОбработатьТабличнуюЧасть(ВладельцыПараметров, мПорядокПараметров, ОбъектТипПеревозки.ГруппыПараметровЗаявки, ОбъектТипПеревозки.ПараметрыЗаявки);
		
		//Параметры Заказов
		ВладельцыПараметров = Новый Соответствие;
		мПорядокПараметров 	= новый Массив;
		ОбработатьТабличнуюЧасть(ВладельцыПараметров, мПорядокПараметров, ОбъектТипПеревозки.ГруппыПараметровЗаказа, ОбъектТипПеревозки.ПараметрыЗаказа);
		
				
		ОбъектТипПеревозки.ОбменДанными.Загрузка = Истина;
		
		Попытка
			ОбъектТипПеревозки.Записать();
			ЗаписатьОбработанныеДанные(Выборка.Ссылка, "CW_ТипыПеревозок");
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат истина;
	
КонецФункции

&НаСервере
Функция ДополнитьДанныеГрузоперевозокНаСервере(Обработано)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	НЕ CW_Грузоперевозки.Ссылка В
	               |				(ВЫБРАТЬ
	               |					CW_СлужебныйВыполненПереход.Объект КАК Объект
	               |				ИЗ
	               |					РегистрСведений.CW_СлужебныйВыполненПереход КАК CW_СлужебныйВыполненПереход
	               |				ГДЕ
	               |					CW_СлужебныйВыполненПереход.ТипОбъекта = &ТипОбъекта)";
	
	Запрос.УстановитьПараметр("ТипОбъекта", "CW_Грузоперевозки");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Обработано = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
		
		ВладельцыПараметров = Новый Соответствие;
		мПорядокПараметров 	= новый Массив;
		
		ОбъектГрузоперевозка = Выборка.Ссылка.ПолучитьОбъект();
		
		ОбработатьТабличнуюЧасть(ВладельцыПараметров, мПорядокПараметров, ОбъектГрузоперевозка.ГруппыПараметровГрузоперевозки, ОбъектГрузоперевозка.ПараметрыГрузоперевозки);
		
		ОбновитьХарактеристикиОбъекта(Выборка.Ссылка, ВладельцыПараметров, мПорядокПараметров);
		
		ОбъектГрузоперевозка.ОбменДанными.Загрузка = Истина;
		
		Попытка
			ОбъектГрузоперевозка.Записать();
			ЗаписатьОбработанныеДанные(Выборка.Ссылка, "CW_Грузоперевозки");
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ДополнитьДанныеЗаказовНаСервере(Обработано)
	
	Запрос = Новый Запрос;       
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	               |	CW_Заказы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Заказы КАК CW_Заказы
	               |ГДЕ
	               |	НЕ CW_Заказы.Ссылка В
	               |				(ВЫБРАТЬ
	               |					CW_СлужебныйВыполненПереход.Объект КАК Объект
	               |				ИЗ
	               |					РегистрСведений.CW_СлужебныйВыполненПереход КАК CW_СлужебныйВыполненПереход
	               |				ГДЕ
	               |					CW_СлужебныйВыполненПереход.ТипОбъекта = &ТипОбъекта)";

	Запрос.УстановитьПараметр("ТипОбъекта", "CW_Заказы");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Обработано = Выборка.Количество();

	Пока Выборка.Следующий() Цикл
		
		ВладельцыПараметров = Новый Соответствие;
		мПорядокПараметров 	= новый Массив;
		
		ОбъектЗаказ = Выборка.Ссылка.ПолучитьОбъект();
		
		ОбработатьТабличнуюЧасть(ВладельцыПараметров, мПорядокПараметров, ОбъектЗаказ.ГруппыПараметровЗаказа, ОбъектЗаказ.ПараметрыЗаказа);
		
		ОбновитьХарактеристикиОбъекта(Выборка.Ссылка, ВладельцыПараметров, мПорядокПараметров);
		
		ОбъектЗаказ.ОбменДанными.Загрузка = Истина;
		
		Попытка
			ОбъектЗаказ.Записать();
			ЗаписатьОбработанныеДанные(Выборка.Ссылка, "CW_Заказы");
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ДополнитьДанныеЗаявокНаСервере(Обработано)
	
	Запрос = Новый Запрос;                          
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	|	CW_Заявки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_Заявки КАК CW_Заявки
	|ГДЕ
	|	НЕ CW_Заявки.Ссылка В
	|				(ВЫБРАТЬ
	|					CW_СлужебныйВыполненПереход.Объект КАК Объект
	|				ИЗ
	|					РегистрСведений.CW_СлужебныйВыполненПереход КАК CW_СлужебныйВыполненПереход
	|				ГДЕ
	|					CW_СлужебныйВыполненПереход.ТипОбъекта = &ТипОбъекта)";
	
	Запрос.УстановитьПараметр("ТипОбъекта", "CW_Заявки");

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Обработано = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
		
		ВладельцыПараметров = Новый Соответствие;
		мПорядокПараметров 	= новый Массив;
		
		ОбъектЗаявка = Выборка.Ссылка.ПолучитьОбъект();
		
		ОбработатьТабличнуюЧасть(ВладельцыПараметров, мПорядокПараметров, ОбъектЗаявка.ГруппыПараметровЗаявки, ОбъектЗаявка.ПараметрыЗаявки);
		
		ОбновитьХарактеристикиОбъекта(Выборка.Ссылка, ВладельцыПараметров, мПорядокПараметров);

	
		ОбъектЗаявка.ОбменДанными.Загрузка = Истина;
		Попытка
			ОбъектЗаявка.Записать();
			ЗаписатьОбработанныеДанные(Выборка.Ссылка, "CW_Заявки");
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции



&НаСервере
Процедура ЗаписатьОбработанныеДанные(Объект, ТипОбъекта)
	
	Запись = РегистрыСведений.CW_СлужебныйВыполненПереход.СоздатьМенеджерЗаписи();
	Запись.Объект 		= Объект;
	Запись.ТипОбъекта 	= ТипОбъекта;
	Запись.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТабличнуюЧасть(ВладельцыПараметров, мПорядокПараметров, ГруппыПараметров, Параметры)
	
	Для Каждого СтрокаГрупп из ГруппыПараметров Цикл
		Если СтрокаГрупп.Наименование <> "Корень" тогда
			Если Не ЗначениеЗаполнено(СтрокаГрупп.ИдентификаторГруппы) или ОбновитьСуществующиеДанные Тогда 
				СтрокаГрупп.ИдентификаторГруппы = Новый УникальныйИдентификатор;
			КонецЕсли;
		КонецЕсли;
		
		мИдентифкаторВедомых =  ЗначениеИзСтрокиВнутр(СтрокаГрупп.ИдентификаторыВедомых);
		Для каждого ПодчиненныйЭлемент Из мИдентифкаторВедомых Цикл
			
			Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
				ПодчиненныйЭлементОбъект = ПодчиненныйЭлемент.ПолучитьОбъект();
				Если ПодчиненныйЭлементОбъект = Неопределено Тогда
					Продолжить;
				КонецЕсли;                                                                                            
			Конецесли;
			
			ЭтоГруппа = ТипЗнч(ПодчиненныйЭлемент) = Тип("Число");
			Если ЭтоГруппа Тогда
				ОтборПоИдентификаторуГруппы = Новый Структура("Идентификатор",ПодчиненныйЭлемент);
				мСтроки = ГруппыПараметров.НайтиСтроки(ОтборПоИдентификаторуГруппы);
			Иначе
				мПорядокПараметров.Добавить(ПодчиненныйЭлемент);
				
				ВладельцыПараметров.Вставить(ПодчиненныйЭлемент, СтрокаГрупп.ИдентификаторГруппы);
				
				ОтборПоПараметру = Новый Структура("Параметр",ПодчиненныйЭлемент);
				мСтроки = Параметры.НайтиСтроки(ОтборПоПараметру);
			КонецЕсли;
			
			Порядок = мИдентифкаторВедомых.Найти(ПодчиненныйЭлемент);
			Порядок = ?(Порядок = Неопределено,0, Порядок);
			
			Для Каждого СтрокаМассива из мСтроки Цикл
				Если СтрокаМассива.ИдентификаторВладельца <> СтрокаГрупп.ИдентификаторГруппы Тогда
					СтрокаМассива.ИдентификаторВладельца = СтрокаГрупп.ИдентификаторГруппы;
				КонецЕсли;
				Если ЭтоГруппа Тогда
					СтрокаМассива.Порядок = Порядок;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьХарактеристикиОбъекта(СсылкаНаОбъект, ВладельцыПараметров, мПорядокПараметров)
	
	ЗапросГрузоперевозка = Новый Запрос;
	ЗапросГрузоперевозка.Текст = "ВЫБРАТЬ
	|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	|	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
	|	ЕСТЬNULL(CW_ГрузоперевозкиПараметрыГрузоперевозки.ИдентификаторВладельца, НЕОПРЕДЕЛЕНО) КАК ИдентификаторВладельца,
	|	ВЫБОР
	|		КОГДА CW_ГрузоперевозкиПараметрыГрузоперевозки.Параметр ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Служебный
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_Грузоперевозки.ПараметрыГрузоперевозки КАК CW_ГрузоперевозкиПараметрыГрузоперевозки
	|		ПО CW_ХарактеристикиГрузоперевозок.Грузоперевозка = CW_ГрузоперевозкиПараметрыГрузоперевозки.Ссылка
	|			И CW_ХарактеристикиГрузоперевозок.Параметр = CW_ГрузоперевозкиПараметрыГрузоперевозки.Параметр
	|ГДЕ
	|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка = &Грузоперевозка";
	
	ЗапросГрузоперевозка.УстановитьПараметр("Грузоперевозка", СсылкаНаОбъект);
	
	РезультатЗапросаГрузоперевозка = ЗапросГрузоперевозка.Выполнить();
	ВыборкаГрузоперевозка = РезультатЗапросаГрузоперевозка.Выбрать();
	
	Пока ВыборкаГрузоперевозка.Следующий() Цикл
		ЗаписьРегистра = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Грузоперевозка 	= ВыборкаГрузоперевозка.Грузоперевозка;
		ЗаписьРегистра.Параметр 		= ВыборкаГрузоперевозка.Параметр;
		
		ЗаписьРегистра.Прочитать();
		Если ЗаписьРегистра.Выбран() Тогда
			
			Порядок = мПорядокПараметров.Найти(ВыборкаГрузоперевозка.Параметр);
			Порядок = ?(Порядок = Неопределено,0, Порядок);
			
			ЗаписьРегистра.Служебный	 			= ВыборкаГрузоперевозка.Служебный;
			ЗаписьРегистра.ИдентификаторВладельца 	= ВладельцыПараметров.Получить(ВыборкаГрузоперевозка.Параметр);
			ЗаписьРегистра.Порядок 					= Порядок;
			
			ЗаписьРегистра.Записать();
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

//Обработка данных


&НаКлиенте
Процедура ПрерватьВыполнение(Команда)
	
	ОтключитьОбработчикОжидания(ИмяОбработчика);
	ОтключитьОбработчикОжидания("ВыполнитьОбработкуСправочников");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВерсиюПриОткрытииНаСервере()
	
	//Минимальная версия 8.3.8.4
	мМинимальнаяВерсия = СтрРазделить("8.3.8.4",".",Ложь);
	
	//Максиамальную временно не ограничиваем
	СтрТекущаяВерсия = CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы();
	мДанныеВерсии = СтрРазделить(СтрТекущаяВерсия,".",Ложь);
	
	Для Индекс = 0 по 3 Цикл
		ЧислоТекущая		= Число(мДанныеВерсии[Индекс]);
		ЧислоМинимальная	= Число(мМинимальнаяВерсия[Индекс]);
		
		Если ЧислоТекущая > ЧислоМинимальная Тогда
			//Значение текущей версии больше минимальной
			Возврат Истина;
		ИначеЕсли 	ЧислоТекущая < ЧислоМинимальная  Тогда
			//Значение текущей версии меньше минимальной
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	//Версии минимальна
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВерсияПодходит = ПроверитьВерсиюПриОткрытииНаСервере();
	
	Если Не ВерсияПодходит Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьФормуОбработки", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения,"Данная обработка не предназначена для текущей версии. Минимальная версия 8.3.8.5");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуОбработки(ДополнительныеПараметры) Экспорт
	
	ЭтаФорма.Закрыть();
КонецПроцедуры
